; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v4 - type_1 ?v5 - type_2)
 	      (pred_3 ?v7 - object ?v5 - type_2)
	      (pred_4 ?v4 - type_1 ?v2 - type_3)
	      (pred_1 ?v4 - type_1 ?v7 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v4 - type_1 ?v8 ?v6 - type_2)
       :precondition (and  (pred_2 ?v4 ?v8))
       :effect (and  (pred_2 ?v4 ?v6)
		     (not (pred_2 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_1 ?v1 - object ?v3 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v3) (pred_2 ?v4 ?v3) (pred_4 ?v4 ?v2))
       :effect (and (pred_1 ?v4 ?v1 ?v2)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_4 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_1 ?v1 - object ?v3 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v1 ?v2) (pred_2 ?v4 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_4 ?v4 ?v2)
		    (not (pred_1 ?v4 ?v1 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_1
obj_02 obj_05 - type_3
obj_09 obj_08 obj_01 obj_04 - type_2
obj_10 obj_06 obj_03 - object)
(:init
(pred_2 obj_07 obj_01)
(pred_4 obj_07 obj_02)
(pred_4 obj_07 obj_05)
(pred_3 obj_10 obj_01)
(pred_3 obj_06 obj_01)
(pred_3 obj_03 obj_08)
)
(:goal
(and
(pred_3 obj_10 obj_09)
(pred_3 obj_06 obj_01)
(pred_3 obj_03 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_07 ?b obj_02))))
)
)

; plan
1. (op_3 obj_07 obj_10 obj_01 obj_05)
   deleted: (pred_3 obj_10 obj_01) (pred_4 obj_07 obj_05)
   added: (pred_1 obj_07 obj_10 obj_05)
   goals met: 1 of 3
2. (op_1 obj_07 obj_01 obj_09)
   deleted: (pred_2 obj_07 obj_01)
   added: (pred_2 obj_07 obj_09)
   goals met: 1 of 3
3. (op_2 obj_07 obj_10 obj_09 obj_05)
   deleted: (pred_1 obj_07 obj_10 obj_05)
   added: (pred_3 obj_10 obj_09) (pred_4 obj_07 obj_05)
   goals met: 2 of 3
4. (op_1 obj_07 obj_09 obj_08)
   deleted: (pred_2 obj_07 obj_09)
   added: (pred_2 obj_07 obj_08)
   goals met: 2 of 3
5. (op_3 obj_07 obj_03 obj_08 obj_05)
   deleted: (pred_3 obj_03 obj_08) (pred_4 obj_07 obj_05)
   added: (pred_1 obj_07 obj_03 obj_05)
   goals met: 2 of 3
6. (op_1 obj_07 obj_08 obj_01)
   deleted: (pred_2 obj_07 obj_08)
   added: (pred_2 obj_07 obj_01)
   goals met: 2 of 3
7. (op_2 obj_07 obj_03 obj_01 obj_05)
   deleted: (pred_1 obj_07 obj_03 obj_05)
   added: (pred_3 obj_03 obj_01) (pred_4 obj_07 obj_05)
   goals met: 3 of 3
